modules/admin/controllers/PermisosUsuarioController.php

SELECT * FROM "seguridad"."usuarios" WHERE "id_usuario"='1'
---
    protected function findModel($id_usuario)
    {
        if( ($model = Usuario::findOne( $id_usuario )) !== null)