modules/admin/views/usuarios/_form.php

                                        <input type="hidden" name="cedulausuario" id="cedulausuario" >
                                        <div id="div_validacedula"style="font-size:16px;color:red;display:none" ></div> <!--mensaje validar cedula usuario--><br>

                                        <?= $form->field($model, 'id_direccion')->dropdownList(Arrayhelper::map(Direccion::find()->orderBy('nombre')->all(), 'iddireccion', 'nombre'), ['prompt' => 'unidad'])->label('Unidad Administrativa');?>
---
SELECT * FROM "direccion" ORDER BY "nombre"