modules/bienes/views/sede/_form.php


    <?= $form->field($model, 'nombre')->textInput() ?>

    <?= $form->field($model, 'id_localidad')->widget(Select2::classname(), [

      'model' => $BienesLocalidad,
      'attribute' => 'descripcion',
      'data'=>Arrayhelper::map($BienesLocalidad::find()->all(), 'id_localidad', 'nombre'),
        'options' => ['placeholder' => 'Seleccione una sede ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],])->label('Seleccione una localidad');?>
---
SELECT * FROM "bienes"."localidad"