modules/bienes/views/sede/index.php

SELECT * FROM "bienes"."localidad" WHERE "id_localidad"=21
SELECT * FROM "bienes"."sede" LIMIT 20
SELECT COUNT(*) FROM "bienes"."sede"
---


      <?php Pjax::begin(); ?>
    <?= GridView::widget([
      'id' => 'gridview',
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
      'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

        'id_sede',
            'nombre',
            [
              'attribute' => 'id_localidad',
              'value' => function($BienesLocalidad){
              $Localidad = BienesLocalidad::findOne($BienesLocalidad->id_localidad);
              return $Localidad->nombre;
            },

            ],

       [
                'class' => 'yii\grid\ActionColumn',
                'template' => '{view}{update}{delete}',
                'buttons' => [