modules/bienes/views/sede/view.php

SELECT * FROM "bienes"."localidad" WHERE "id_localidad"=20
---

    <h1><?= Html::encode($this->title) ?></h1>

    <?= DetailView::widget([
        'model' => $model,
        'attributes' => [
            'id_sede',
            'nombre',
            [
              'attribute' => 'id_localidad',
              'value' =>  BienesLocalidad::findOne($model->id_localidad)->nombre
            ],
        ],
    ]) ?>