modules/bienes/controllers/BienesController.php

    public function actionView($id_codigo, $id_direccion, $identificacion)
    {
        return $this->render('view', [
            'model' => BienesNCodigoBien::findOne(['id_codigo'=>$id_codigo,'id_direccion'=> $id_direccion, 'identificacion'=> $identificacion]),


            //'model' => $this->findModel($id_codigo, find->where('$BienesLocalidad' = $id_localidad),
            //$BienesLocalidad

          //  (['view', 'id_codigo' => $model->id_codigo, 'id_localidad' => $model->id_localidad]);

        ]);
    }

    /**
     * Creates a new BienesNCodigoBien model.
     * If creation is successful, the browser will be redirected to the 'view' page.
     * @return mixed
     */
    public function actionCreate()
    {
        $model = new BienesNCodigoBien();


        // $model->nombre= '1';
        // $model->descripcion= 'esta es la descripcion';
        // $model->valor_unidad= 1;
        // $model->justiprecio= 1;
        // $model->ano_adquisicion= 'XXXX-XX-XX';
        // $model->ubicacion= 1;
        // $model->tipo_adquisicion= 1;
        // $model->n_documento= 1;
        // $model->id_sede= 1;
        // $model->identificacion= 1;
        // $model->id_codigo = 2;
        // $model->id_localidad = 2;


        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM "bienes"."n_codigo_bien" WHERE ("id_codigo"='417') AND ("id_direccion"='129') AND ("identificacion"='9090909')
INSERT INTO "bienes"."n_codigo_bien" ("id_direccion", "id_usuario", "codigo_resp", "moneda", "otra_mon", "codigo_origen", "id_sede", "id_codigo", "descripcion", "otras_descripciones", "identificacion", "ubicacion", "valor_unidad", "justiprecio", "tipo_adquisicion", "ano_adquisicion", "n_documento", "uso", "otro_es", "ingreso", "estado", "otro_estado", "descripcion_es", "serial", "codigo_marca", "codigo_modelo", "ano_fabricacion", "codigo_color", "otro_color", "otros_color", "medida_garantia", "garantia", "inicio_garantia", "fin_garantia", "componentes", "asegurado", "codigo_seguro") VALUES (129, 48, 'XXX', 1, 'noaplica', 'B-16', 1, 417, 'kkl', '', 9090909, 'kklj', NULL, NULL, '1', '2016-01-20', '09098', NULL, '', NULL, NULL, '', '', '', NULL, NULL, NULL, NULL, '', '', 99, NULL, NULL, NULL, '', '', NULL) RETURNING "id_codigo", "id_direccion", "identificacion"