modules/bienes/controllers/CodigoController.php

    public function actionCreate()
    {


        $model = new BienesCodigo();
        $model->padre = 0;
        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO "bienes"."codigo" ("padre", "codigo", "descripcion") VALUES (111, 2, 'Fusiles') RETURNING "id_codigo"