modules/bienes/views/codigo/_form.php

SELECT * FROM "bienes"."codigo"
---
    <?= $form->field($model, 'descripcion')->textInput() ?>

    <?=//= $form->field($model, 'padre')->textInput()
         $form->field($model, 'padre')->dropDownList(arrayhelper::map(BienesCodigo::find()->all(),'id_codigo', function($data)
                {
                    return Html::encode($data->codigo.'---'. $data->descripcion);
                }),
	['prompt'=>'Descripción']);