modules/admin/models/Grupo.php

    public static function getGrupos()
    {
        $items = [];
        foreach ( self::find()->all() as $grupo )
---
SELECT * FROM "seguridad"."grupo"