modules/admin/models/SeguridadUsuarios.php

SELECT * FROM "seguridad"."grupo" WHERE "id_grupo"=2
---
                    foreach( $usuario->idGrupos as $grupo )
                    {
                        $grupo instanceof Grupo;
                        $permiso = AccionGrupo::findOne( [
                            'id_accion' => $accion->id_accion,
                            'id_controlador' => $controlador->id_controlador,
                            'id_grupo' => $grupo->id_grupo,
                        ] );