modules/bienes/views/bienes/_form.php


      'model' => $Sede,
      'attribute' => 'nombre',
      'data'=>Arrayhelper::map($Sede::find()->all(), 'id_sede', 'nombre'),
---
SELECT * FROM "bienes"."sede"

        ],])->label('Sede');?>


    <?= $form->field($model, 'id_codigo')->widget(Select2::classname(), [

      'model' => $BienesCodigo,
      'attribute' => 'descripcion',
      'data'=>Arrayhelper::map($BienesCodigo::find()->where("padre > 77")->all(),'id_codigo', function($data)
                {return Html::encode($data->codigo_completo.'---'. $data->descripcion);    }),
        'options' => ['placeholder' => 'Seleccione una Categoría ...'],
        'pluginOptions' => [
          'allowClear' => true
        ],])->label('Categoría');?>
---
SELECT * FROM "bienes"."codigo"
SELECT * FROM "bienes"."codigo" WHERE padre > 77
SELECT * FROM "bienes"."codigo" WHERE padre  < 10

        */?>

<? /*
        $dataCategoria=ArrayHelper::map($BienesCodigo::find()->where('padre is null')->all(),'id_codigo', function($data)
                            {return Html::encode($data->codigo_completo.'---'. $data->descripcion);});
---
SELECT * FROM "bienes"."codigo" WHERE padre isnull

                {return Html::encode($data->codigo_completo.'---'. $data->descripcion);    }),['prompt'=>'Seleccion un Codigo'])->label('Sub-Categoria2');
      ?>

      <?= $form->field($model, 'id_codigo')->dropDownList(arrayhelper::map($BienesCodigo::find()->where("padre > 77")->all(),'id_codigo', function($data)
                {return Html::encode($data->codigo_completo.'---'. $data->descripcion);    }),['prompt'=>'Seleccion un Codigo'])->label('Tipo');
---
SELECT * FROM "bienes"."codigo" WHERE padre > 77