modules/bienes/views/bienes/_form.php

SELECT * FROM "bienes"."sede"
---
        <?= $form->field($model, 'codigo_origen')->hiddenInput(['id'=>'origen'])->label(false); ?>


     <?= $form->field($model, 'id_sede')->widget(Select2::classname(), [
      'model' => $Sede,
      'attribute' => 'nombre',
      'data'=>Arrayhelper::map($Sede::find()->all(), 'id_sede', 'nombre'),
        'options' => ['placeholder' => 'Seleccione una sede ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],])->label('Sede');?>

SELECT * FROM "bienes"."uso"
---

                <div class="col-md-3 column">

     <?= $form->field($model, 'uso')->widget(Select2::classname(), [
      'model' => $BienesUso,
      'attribute' => 'descripcion',
      'data'=>Arrayhelper::map($BienesUso::find()->all(), 'id_uso','descripcion'),
        'options' => ['placeholder' => 'Seleccione un Estatus ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],])->label('Estatus de uso');?>