modules/bienes/views/bienes/index.php

        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            [
              'attribute' => 'id_codigo',
              'value' => function($BienesCodigo){
              $Codigo = BienesCodigo::findOne($BienesCodigo->id_codigo);
              return $Codigo->descripcion;
                },
            ],
---
SELECT * FROM "bienes"."codigo" WHERE "id_codigo"=1527
SELECT * FROM "bienes"."codigo" WHERE "id_codigo"=425