modules/bienes/views/bienes/view.php

SELECT * FROM "bienes"."codigo" WHERE "id_codigo"=417
---
/* @var $this yii\web\View */
/* @var $model app\modules\bienes\models\BienesNCodigoBien */

$this->title = BienesCodigo::findOne($model->id_codigo)->codigo_completo;

SELECT * FROM "bienes"."codigo" WHERE "id_codigo"=417
SELECT * FROM "bienes"."sede" WHERE "id_sede"=1
---
        'attributes' => [
            [
              'attribute' => 'nombre',
              'value' =>  BienesCodigo::findOne($model->id_codigo)->descripcion
            ],
            [
              'attribute' => 'Sede',
              'value' =>  BienesSede::findOne($model->id_sede)->nombre