models/Usuario.php

    public static function findByUsername($username)
    {
        return static::findOne(['login' => $username]);
---
SELECT * FROM "usuario" WHERE "login"='administrador'

                    foreach( $usuario->idGrupos as $grupo )
                    {
                        $grupo instanceof Grupo;
                        $permiso = AccionGrupo::findOne( [
                            'id_accion' => $accion->id_accion,
                            'id_controlador' => $controlador->id_controlador,
                            'id_grupo' => $grupo->id_grupo,
                        ] );
---
SELECT * FROM "seguridad"."grupo" WHERE "id_grupo" IN (2, 4)